/* USERS TABLE (insert users into table) */

INSERT INTO users VALUES
(1, 'Максим', 'Максимов', 'maksim@mail.ru', 12345678, 'avatar01.jpg, avatar01@2x.jpg'),
(2, 'Антон', 'Антонов', 'anton@mail.ru', 12345678, 'avatar02.jpg, avatar02@2x.jpg');

/* OFFERS TABLE (insert offers into table) */

INSERT INTO offers VALUES
(1, 1, 'Продам носки', 'Реально хорошие носки', 100, 'sell', '2020-10-10', 'item01.jpg, item01@2x.jpg'),
(2, 1, 'Продам почку', 'Реально как новая, зуб даю=)', 1000, 'sell', '2020-03-10', 'item02.jpg, item02@2x.jpg'),
(3, 1, 'Куплю шалаш', 'Просто негде жить пацпны. Такие дела...', 100, 'buy', '2020-05-10', 'item03.jpg, item03@2x.jpg'),
(4, 2, 'Куплю Tetris', 'Ищу tetris 999999 в 1', 245, 'buy', '2020-07-14', 'item04.jpg, item04@2x.jpg'),
(5, 2, 'Продам мадагаскарских тараканов', 'Очень крупные красавцы', 22245, 'sell', '2020-02-11', 'item05.jpg, item05@2x.jpg'),
(6, 2, 'Куплю голубиный помет', 'Нужно реально много', 365, 'buy', '2020-11-30', 'item06.jpg, item06@2x.jpg');

/* COMMENTS TABLE (insert offer comments into table) */

INSERT INTO comments VALUES
(1, 1, 2, 'Ого, беру', '2020-10-10'),
(2, 1, 2, 'А еще есть?', '2020-03-10'),
(3, 2, 2, 'Мне нужно две...', '2020-05-10'),
(4, 2, 2, 'Что-то дорого...', '2020-07-14'),
(5, 3, 2, 'Иди сам построй', '2020-02-11'),
(6, 3, 2, 'Есть у меня один на дереве. Будешь брать?', '2020-11-30'),
(7, 4, 1, 'Во чего захотел)', '2020-02-11'),
(8, 4, 1, 'У меня есть такой, но отдам дорого так то.', '2020-11-30'),
(9, 5, 1, 'Ой какая милота ми-ми-ми=)', '2020-02-11'),
(10, 5, 1, 'Какие усатые то, у моего кота и то меньше усы.', '2020-11-30'),
(11, 6, 1, 'Так иди на улице собери', '2020-02-11'),
(12, 6, 1, 'Готов продать. У меня его куры не клюют', '2020-11-30');

/* CATEGORIES TABLE (insert categories into table) */

INSERT INTO categories VALUES
(1, 'Разное'),
(2, 'Одежда'),
(3, 'Электроника'),
(4, 'Органы'),
(5, 'Живность'),
(6, 'Недвижимость');

/* OFFERS_CATEGORIES TABLE (insert offers and categories relations into table) */

INSERT INTO offers_categories VALUES
(1, 2),
(2, 4),
(3, 6),
(4, 3),
(5, 1),
(5, 5),
(6, 1);
